In [1]:
import sys
import os
import pandas as pd
import pdfplumber
from src.exception import CustomException
from src.ETL_manager import DataIngestor
from src.ETL_manager import DataProcessor
from src.inputs.mapping import map_subcategory
from src.inputs.column_structure import get_cols

input_file = '/raw_file/915010018577756.csv'            # Enter you file directory with name
input_file = os.getcwd()+input_file
col_names_1 = get_cols.col1()
df = DataIngestor.read_statement(
    file_path=input_file, 
    col_names=col_names_1
    )

In [2]:
df.head()

,Date,ChqNo,Particulars,Debit,Credit,Balance,BR_Code
0,19-09-2024,-,UPI/P2M/426333754787/Mr S Chandran /UPI...,40.00,,443.64,1355.0
1,19-09-2024,-,UPI/P2M/462916460827/MANIGANDAN /UPI...,20.00,,423.64,1355.0
2,19-09-2024,-,UPI/P2M/426398459712/ASHRAF U K /UPI...,30.00,,393.64,1355.0
3,19-09-2024,-,UPI/P2M/426314447901/HungerBox /Hun...,82.00,,311.64,1355.0
4,19-09-2024,-,UPI/P2M/426336868830/RAMBABU YADAV /UPI...,10.00,,301.64,1355.0

In [3]:
input_file = r'/raw_file/hdfc_statement.xlsx'
input_file = os.getcwd()+input_file
col_names_2 = get_cols.col2()
df_1  = DataIngestor.read_statement(input_file, col_names=col_names_2)

In [4]:
df_new = DataIngestor.rearrange_clean_features(df, 1, col_names_1, col_names_2)
df_new.head()

,Date,Particulars,Debit,Credit,Balance
0,19-09-2024,UPI/P2M/426333754787/Mr S Chandran /UPI...,40.00,,443.64
1,19-09-2024,UPI/P2M/462916460827/MANIGANDAN /UPI...,20.00,,423.64
2,19-09-2024,UPI/P2M/426398459712/ASHRAF U K /UPI...,30.00,,393.64
3,19-09-2024,UPI/P2M/426314447901/HungerBox /Hun...,82.00,,311.64
4,19-09-2024,UPI/P2M/426336868830/RAMBABU YADAV /UPI...,10.00,,301.64

In [5]:
df_new.dtypes

Date            object
Particulars     object
Debit           object
Credit          object
Balance        float64
dtype: object

In [8]:
df_new = DataIngestor.rearrange_clean_features(df_1, 2, col_names_1, col_names_2)

In [9]:
df_new

,Date,Particulars,ChqNo,Debit,Credit,Balance
0,********,**********************************,************,******************,******************,******************
1,30/08/24,082024 SALARY CREDIT FOR 20532356/SOURAV,0000408297529599,NaN,74941,102004.42
2,30/08/24,IMPS-424320347279-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000424320347279,1000,NaN,101004.42
3,31/08/24,.IMPS P2P 423409352210#21/08/2024 210824-MIR25...,MIR2524395700585,4.14,NaN,101000.28
4,31/08/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",N244243236619002,30000,NaN,71000.28
5,02/09/24,"NEFT DR-PUNB0017720-RICHA HORE-NETBANK, MUM-N2...",N246243238840545,4765,NaN,66235.28
6,02/09/24,ME DC SI 435584XXXXXX8577 GOOGLE PLAY SER CYBS S,0000424618050280,130,NaN,66105.28
7,03/09/24,.IMPS P2P 423714320862#24/08/2024 240824-MIR25...,MIR2524598746529,5.9,NaN,66099.38
8,03/09/24,.IMPS P2P 423821370132#25/08/2024 250824-MIR25...,MIR2524699696806,4.14,NaN,66095.24
9,03/09/24,.IMPS P2P 423921329460#26/08/2024 260824-MIR25...,MIR2524600400182,4.14,NaN,66091.1
10,04/09/24,ATW-435584XXXXXX8577-P3ENBL81-BANGALORE,0000000000002921,3000,NaN,63091.1
11,05/09/24,"NEFT DR-PUNB0017720-RICHA HORE-NETBANK, MUM-N2...",N249243246520383,2641,NaN,60450.1
12,06/09/24,.IMPS P2P 424320347279#30/08/2024 300824-MIR25...,MIR2525013049515,4.14,NaN,60445.96
13,07/09/24,EMI 148443967 CHQ S1484439670081 0924148443967,000000000000000,7116,NaN,53329.96
14,10/09/24,"NEFT DR-SBIN0003301-B VIJAYARAJ-NETBANK, MUM-N...",N254243258344907,16418,NaN,36911.96
15,10/09/24,IMPS-425410354485-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000425410354485,6000,NaN,30911.96
16,15/09/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",N259243268765146,3000,NaN,27911.96
17,16/09/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",N260243269251680,2500,NaN,25411.96
18,17/09/24,IMPS-426123395822-RICHA HORE-PUNB-XXXXXXXXX932...,0000426123395822,1153,NaN,24258.96
19,18/09/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",N262243272733080,1000,NaN,23258.96
20,19/09/24,IMPS-426321368064-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000426321368064,500,NaN,22758.96
21,20/09/24,IMPS-426418309246-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000426418309246,500,NaN,22258.96
22,20/09/24,POS 435584XXXXXX8577 MSW*EXPLOREX TEC,0000426421746874,384,NaN,21874.96
23,21/09/24,IMPS-426513383792-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000426513383792,800,NaN,21074.96
24,22/09/24,IMPS-426614362624-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000426614362624,1000,NaN,20074.96
25,22/09/24,IMPS-426621357629-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000426621357629,1000,NaN,19074.96
26,28/09/24,.IMPS P2P 426513383792#21/09/2024 210924-MIR25...,MIR2527299044239,4.14,NaN,19070.82
27,NaN,NaN,NaN,NaN,NaN,NaN
28,********,**********************************,************,******************,******************,******************

In [5]:
set1 = set(col_names_1)
set2 = set(col_names_2)
non_matching_col_names = set1.symmetric_difference(set2)
non_matching_col_names

{'BR_Code', 'Value Dt'}

In [18]:
drop_col_col_1 = [cols for cols in non_matching_words if cols in col_names_1]
drop_col_col_1

['BR_Code']

In [19]:
df = df.drop(columns=drop_col_col_1, axis=1)

In [20]:
df.columns

Index(['Date', 'ChqNo', 'Particulars', 'Debit', 'Credit', 'Balance'], dtype='object')

In [9]:
drop_col_col_2 = [cols for cols in non_matching_words if cols in col_names_2]
drop_col_col_2

['Value Dt']

In [10]:
df_1 = df_1.drop(columns=drop_col_col_2, axis=1)

In [11]:
df_1.head()

,Date,Particulars,ChqNo,Debit,Credit,Balance
0,********,**********************************,************,******************,******************,******************
1,30/08/24,082024 SALARY CREDIT FOR 20532356/SOURAV,0000408297529599,NaN,74941,102004.42
2,30/08/24,IMPS-424320347279-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,0000424320347279,1000,NaN,101004.42
3,31/08/24,.IMPS P2P 423409352210#21/08/2024 210824-MIR25...,MIR2524395700585,4.14,NaN,101000.28
4,31/08/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",N244243236619002,30000,NaN,71000.28

In [18]:
df_1 = DataIngestor.data_cleaner(df_1)

In [19]:
df_1.head()

,Date,Particulars,Debit,Credit,Balance
0,********,**********************************,******************,******************,******************
1,30/08/24,082024 SALARY CREDIT FOR 20532356/SOURAV,NaN,74941,102004.42
2,30/08/24,IMPS-424320347279-SOURAVAXIS-UTIB-XXXXXXXXXXX7...,1000,NaN,101004.42
3,31/08/24,.IMPS P2P 423409352210#21/08/2024 210824-MIR25...,4.14,NaN,101000.28
4,31/08/24,"NEFT DR-UTIB0001355-SOURAVAXIS-NETBANK, MUM-N2...",30000,NaN,71000.28

In [22]:
if '*' in df_1['Date']:
    print('yes')

In [30]:
if r'\*' in df_1.Date.head(10):
    print('yes')
else:
    print('No')

No

In [28]:
df_1['Date'][0]

'********'

In [14]:
df.tail()

,Date,ChqNo,Particulars,Debit,Credit,Balance
59,24-09-2024,-,UPI/P2M/426852923763/HungerBox /Hun...,53.00,,178.14
60,24-09-2024,-,UPI/P2M/463406975141/RAMBABU YADAV /UPI...,10.00,,168.14
61,24-09-2024,-,UPI/P2M/463421567049/RAM MEDICAL /med...,25.00,,143.14
62,24-09-2024,-,UPI/P2M/426845785212/sri annapoorneshwary /tea...,30.00,,113.14
63,24-09-2024,-,UPI/P2M/463480582807/SRINIDHI SAGAR FOODLI/tea...,40.00,,73.14

In [2]:
# read data
input_file = r'/raw_file/hdfc_statement.csv'
input_file = os.getcwd()+input_file
try:
    df = DataIngestor.read_csv_files(
        file_path=input_file, 
        header_identifier='Date', 
        footer_identifier='STATEMENT SUMMARY'
        )
except:
    raise TypeError

TypeError:

In [4]:
df.head()

,Tran Date,CHQNO,PARTICULARS,DR,CR,BAL,SOL
0,19-09-2024,-,UPI/P2M/426333754787/Mr S Chandran /UPI...,40.00,,443.64,1355
1,19-09-2024,-,UPI/P2M/462916460827/MANIGANDAN /UPI...,20.00,,423.64,1355
2,19-09-2024,-,UPI/P2M/426398459712/ASHRAF U K /UPI...,30.00,,393.64,1355
3,19-09-2024,-,UPI/P2M/426314447901/HungerBox /Hun...,82.00,,311.64,1355
4,19-09-2024,-,UPI/P2M/426336868830/RAMBABU YADAV /UPI...,10.00,,301.64,1355

In [2]:
df_new = DataProcessor.remap_transactions(df, transaction_col_name="PARTICULARS")

In [3]:
df_new

,Tran Date,CHQNO,PARTICULARS,exp_name,DR,CR,BAL,SOL
0,19-09-2024,-,Mr S Chandran UPI,None,40.00,,443.64,1355
1,19-09-2024,-,MANIGANDAN UPI,None,20.00,,423.64,1355
2,19-09-2024,-,ASHRAF U K UPI,None,30.00,,393.64,1355
3,19-09-2024,-,HungerBox Hunger,Hunger,82.00,,311.64,1355
4,19-09-2024,-,RAMBABU YADAV UPI,None,10.00,,301.64,1355
...,...,...,...,...,...,...,...,...
60,24-09-2024,-,RAMBABU YADAV UPI,None,10.00,,168.14,1355
61,24-09-2024,-,RAM MEDICAL medici,medici,25.00,,143.14,1355
62,24-09-2024,-,sri annapoorneshwary tea,tea,30.00,,113.14,1355
63,24-09-2024,-,SRINIDHI SAGAR FOODLI tea,tea,40.00,,73.14,1355
64,None,None,None,None,None,None,None,None

In [4]:
category_dropdown = {
    "Loan" : ['HDFC', 'Fibe', 'Credit Card', 'Money View'],
    "Rent" : ['Home', 'Subscription'],
    "Bill" : ['Mobile', 'Internet', 'Water', 'Electricity', 'Maid'],
    "Personal" : ['One Time', 'Recurring', 'Music','Entertainment', 'Father', 'Tour'],
    "Restuarants" : ['DineIn', 'Online'],
    "Wife" : ['Recurring', 'Birds', 'Extras'],
    "Grocery" : ['Regular', 'Quaterly'],
    "Transportation" : ['Fuel', 'Service', 'Wash & Maintainence', 'AutoCab'],
    "Tea_Others" : ['Tea & Others', 'Others'],
    "Food" : ['Snacks', 'Regular', 'Office Food', 'Cooking Gas'],
    "Medical" : ['Medical'],
    "Puja" : ['Flower', 'One Time']
}

In [5]:
df_new.dropna(inplace=True)

In [6]:
index_list = df_new.PARTICULARS.value_counts()

In [7]:
# Sample DataFrame
data = {'col1': ['I like tea', 'Pharmaceutical products', 'Medical supplies', 'Hunger strikes', 'Office food']}
df = pd.DataFrame(data)

# Keyword lists and corresponding values
keywords_dict = {
    'Medical': ['pharma', 'medici'],
    'Office Food': ['hunger']
}

# Iterate through keyword lists and assign values
for category, keywords in keywords_dict.items():
    df.loc[df['col1'].str.contains('|'.join(keywords), case=False), 'Sub'] = category

In [8]:
df_new['DR Amount'] = pd.to_numeric(df_new['DR'], errors='coerce')

# Filter out rows with non-numeric values
df_new = df_new.dropna(subset=['DR'])

In [11]:
df_new[['PARTICULARS', 'DR Amount']]

                     PARTICULARS  DR Amount
0      Mr S Chandran         UPI       40.0
1      MANIGANDAN            UPI       20.0
2      ASHRAF U K            UPI       30.0
3   HungerBox             Hunger       82.0
4      RAMBABU YADAV         UPI       10.0
..                           ...        ...
59  HungerBox             Hunger       53.0
60     RAMBABU YADAV         UPI       10.0
61  RAM MEDICAL           medici       25.0
62     sri annapoorneshwary  tea       30.0
63     SRINIDHI SAGAR FOODLI tea       40.0

[64 rows x 2 columns]

In [113]:
df_new.groupby('PARTICULARS')['DR Amount'].sum().sort_values(ascending=False)

PARTICULARS
AAGHNYAS KITCHEN      barkas    603.0
Sree Kodandarama Serv UPI       595.0
AVIGHNA ENTERPRISES J UPI       290.0
HungerBox             Hunger    284.0
S L V sagar Pharma    medici    257.0
ASHRAF U K            UPI       243.0
Blinkit               Blinki    231.0
PULAK DAS             UPI       216.0
Mr SATISH KUMAR N     UPI       117.0
SRINIDHI SAGAR FOODLI UPI       114.0
Rais  Anwer           UPI       111.0
SRINIDHI SAGAR FOODLI tea        80.0
PURUSHOTHAMA  N       hair c     80.0
THE SRIRANGAM CAFE    tea        75.0
RAMKUMARGUPTASOMOOLC  Pay to     75.0
SREENIVAS NARASIMAPPA fruits     65.0
BHERU HOME APPLIANCES puja       60.0
HARISH                tea        43.0
Rahul                 UPI        40.0
IMPERIAL KOARAMANGALA UPI        40.0
RAMBABU YADAV         UPI        40.0
AJAY TUKALAL YADAV    clip       40.0
sri annapoorneshwary  UPI        40.0
Mr S Chandran         UPI        40.0
HARISH                UPI        38.0
sri annapoorneshwary  tea        30.0
MEGHARAJ H C          UPI        30.0
KHASIM                bike       30.0
ECS Txn Chrgs Incl GST           29.5
MOHAMAD N.            tea        29.0
MAHENDRA SHETTY       UPI        29.0
GANAPATHI N NAIK      UPI        29.0
RAM MEDICAL           medici     25.0
Mr BABU N             UPI        24.0
Cake way              UPI        24.0
Mr S Chandran         food       20.0
MANIGANDAN            flower     20.0
MANIGANDAN            UPI        20.0
GYANESWAR UPADHAYA    UPI        19.0
Durganand Yadav       UPI        15.0
KRISHANA KUMAR YADAV  UPI        10.0
MOHAMAD N.            UPI        10.0
SOURAVMA Remitter                 0.0
Name: DR Amount, dtype: float64